**Topic**

* Concat Columns with Different Header
* Grouper Frequency
  
  (Example: Convert date range into n division)
* Search Column with list of tuples

# **Concat Columns with Different Header**

In [45]:
import pandas as pd
data = {'Model1': ['State',86,23,32,13,45,12],'Model2': ['Age', 96,98,34,12,22,19], 'Model3': ['Number',56,23,44,12,32,33]}
df1 = pd.DataFrame (data)
df1

  Model1 Model2  Model3
0  State    Age  Number
1     86     96      56
2     23     98      23
3     32     34      44
4     13     12      12
5     45     22      32
6     12     19      33

In [46]:
data = {'A': [86,23,32,13,45,12],'B': [96,98,34,12,22,19], 'C': [56,23,44,12,32,33]}
df2 = pd.DataFrame (data)
df2

    A   B   C
0  86  96  56
1  23  98  23
2  32  34  44
3  13  12  12
4  45  22  32
5  12  19  33

In [47]:
df1.columns = df1.iloc[0]
df1 = df1[1:]
df1

0 State Age Number
1    86  96     56
2    23  98     23
3    32  34     44
4    13  12     12
5    45  22     32
6    12  19     33

In [48]:
df2 = df2.rename(columns={"A": "State", "B": "Age", "C":"Number"})

In [49]:
new_df = pd.concat([df1, df2])
new_df

0 State Age Number
1    86  96     56
2    23  98     23
3    32  34     44
4    13  12     12
5    45  22     32
6    12  19     33
0    86  96     56
1    23  98     23
2    32  34     44
3    13  12     12
4    45  22     32
5    12  19     33

In [50]:
df = pd.Series(pd.date_range(start='20180301', end='20180311'))
df = pd.DataFrame(df, columns=['dates'])

# **Grouper Frequency**
  (Example: Convert date range into n division)

In [51]:
df['val'] = [2,4,2,6,3,7,6,9,0.65,5,1]
df = df.set_index('dates')
df

             val
dates
2018-03-01  2.00
2018-03-02  4.00
2018-03-03  2.00
2018-03-04  6.00
2018-03-05  3.00
2018-03-06  7.00
2018-03-07  6.00
2018-03-08  9.00
2018-03-09  0.65
2018-03-10  5.00
2018-03-11  1.00

In [52]:
import numpy as np

outcome = df.groupby(pd.Grouper(freq='3D')).apply(np.min)
outcome

             val
dates
2018-03-01  2.00
2018-03-04  3.00
2018-03-07  0.65
2018-03-10  1.00

# **Search Column with list of tuples**

In [82]:
data = {'col1': [[('asd', 0.99), ('vcxx', 0.77), ('dfs', 0.32)],[('fds', 0.97), ('xcvxc', 0.71), ('vcbtxx', 0.54), ('bfed', 0.12)],[('fdssa', 0.98), ('asdfd', 0.61)]]}
df = pd.DataFrame (data)
df

                                                col1
0           [(asd, 0.99), (vcxx, 0.77), (dfs, 0.32)]
1  [(fds, 0.97), (xcvxc, 0.71), (vcbtxx, 0.54), (...
2                     [(fdssa, 0.98), (asdfd, 0.61)]

In [83]:
df['new_col'] = df.col1.apply(lambda x: [val for val in x if val[1] > 0.75])
df

                                                col1                      new_col
0           [(asd, 0.99), (vcxx, 0.77), (dfs, 0.32)]  [(asd, 0.99), (vcxx, 0.77)]
1  [(fds, 0.97), (xcvxc, 0.71), (vcbtxx, 0.54), (...                [(fds, 0.97)]
2                     [(fdssa, 0.98), (asdfd, 0.61)]              [(fdssa, 0.98)]